<template><div><h1 id="_5-просмотр-объектов" tabindex="-1"><a class="header-anchor" href="#_5-просмотр-объектов" aria-hidden="true">#</a> 5. Просмотр объектов</h1>
<p>Каждая отдельная коллекция продуктов содержит несколько трёхмерных изображений, загруженных в коллекцию. Посмотреть их можно из меню коллекции, нажав на кнопку « <img src="@source/user-docs/img/image21.png" alt="" loading="lazy"> ».</p>
<p><img src="@source/user-docs/img/image22.png" alt="" loading="lazy"></p>
<p><code v-pre>Рис 19. Список моделей.</code></p>
<p>В появившемся окне просмотра можно манипулировать моделью: поворачивать, приближать, отдалять. Также предусмотрена кнопка для перехода в AR представление при помощи смартфона.</p>
<p><img src="@source/user-docs/img/image23.png" alt="" loading="lazy"></p>
<p><code v-pre>Рис 20. Окно просмотра</code></p>
<p>Нажав на кнопку и отсканировав QR код, можно примерить модель в AR представлении.</p>
<p><img src="@source/user-docs/img/image24.png" alt="" loading="lazy"></p>
<p><code v-pre>Рис 21. Кнопка перехода в AR представление.</code></p>
<p>Для того, чтобы открыть созданный продукт и скопировать ссылку на него, требуется нажать на кнопку « <img src="@source/user-docs/img/image25.png" alt="" loading="lazy"> », которая продемонстрирует виджет продукта на отдельной вкладке.</p>
</div></template>


