<template><div><h1 id="_4-управление-продуктами" tabindex="-1"><a class="header-anchor" href="#_4-управление-продуктами" aria-hidden="true">#</a> 4. Управление продуктами</h1>
<h2 id="создание-коллекции" tabindex="-1"><a class="header-anchor" href="#создание-коллекции" aria-hidden="true">#</a> Создание коллекции</h2>
<p><img src="@source/user-docs/img/image5.png" alt="" loading="lazy"></p>
<p><code v-pre>Рис 5. Главная страница</code></p>
<p>Для создания нового продукта сначала требуется создать коллекцию, нажав на кнопку «Создать коллекцию» вверху страницы.</p>
<p>Создавая новую коллекцию, требуется ввести название коллекции.</p>
<p><img src="@source/user-docs/img/image6.png" alt="" loading="lazy"></p>
<p><code v-pre>Рис 6. Создание коллекции</code></p>
<h2 id="новыи-продукт" tabindex="-1"><a class="header-anchor" href="#новыи-продукт" aria-hidden="true">#</a> Новый продукт</h2>
<p>В созданной коллекции требуется нажать на кнопку «создать продукт».</p>
<p><img src="@source/user-docs/img/image7.png" alt="" loading="lazy"></p>
<p><code v-pre>Рис 7. Панель коллекции</code></p>
<p>Первым шагом в создании нового продукта является ввод названия и уникального идентификатора (артикула). После их ввода требуется нажать «Далее».</p>
<p><img src="@source/user-docs/img/image8.png" alt="" loading="lazy"></p>
<p><code v-pre>Рис 8. Создание продукта</code></p>
<h2 id="загрузка-модели" tabindex="-1"><a class="header-anchor" href="#загрузка-модели" aria-hidden="true">#</a> Загрузка модели</h2>
<p>Следующий шаг – загрузка модели. Требуется нажать на поле загрузки и выбрать в открывшемся файловом проводнике необходимую модель, или перетащить значок модели в область загрузки. Система принимает четыре типа файлов с моделями продукта. Поддерживаемые форматы представлены в Таблице 1.</p>
<!-- title only -->
<h4 align="center"> Типы файлов моделей</h4>
<table>
<thead>
<tr>
<th>Расширение файла</th>
<th>Описание</th>
</tr>
</thead>
<tbody>
<tr>
<td><strong>Obj</strong></td>
<td>Основной тип файлов моделей, для корректного отображения требуется провести конвертацию в иные форматы</td>
</tr>
<tr>
<td><strong>Glb/Gltf</strong></td>
<td>Форматы модели, необходимые для отображения продукта на сайте и в системе Android.</td>
</tr>
<tr>
<td><strong>Usdz</strong></td>
<td>Формат модели, поддерживаемый операционной системой IOS.</td>
</tr>
<tr>
<td><strong>Fbx</strong></td>
<td>Обменный формат 3Ds Max</td>
</tr>
</tbody>
</table>
<p>Для корректного отображения модели также установлены граничные условия. При нарушении данных условий модель может отображаться некорректно или не четко:</p>
<ul>
<li>В одном загружаемом файле должно быть не более одной модели.</li>
<li>Модель не должна быть &quot;тяжёлой&quot;. (предел – 10000 полигонов и 25 мб).</li>
<li>Развёртка текстур должна соответствовать развёртке модели, натяжений быть не должно.</li>
<li>Для реалистичного отображения модели должны быть представлены минимум три карты текстур: Base color, Normal и Metallic-Roughness. В карте текстур Metallic-Roughness металлические поверхности должны быть отмечены зелёным, неметаллические – синим.</li>
</ul>
<p><img src="@source/user-docs/img/image9.png" alt="" loading="lazy"></p>
<p><code v-pre>Рис 9. Поле загрузки модели</code></p>
<p>После загрузки модели требуется нажать на кнопку автоматической конвертации, если нет моделей всех необходимых расширений.</p>
<p><img src="@source/user-docs/img/image10.png" alt="" loading="lazy"></p>
<p><code v-pre>Рис 10. Конвертация моделей</code></p>
<p>Если предполагается демонстрация продукта на слабых платформах, после конвертации модели требуется преобразовать отображение продукта в более «легкую» форму. Для этого над окном представления модели расположена кнопка <strong>«адаптив»</strong>.</p>
<p><strong>L</strong> Это наиболее чёткая, но и наиболее массивная в плане обработки и представления модель. Отображение модели на слабых платформах может занять долгое время.</p>
<p><strong>M</strong> Среднее качество модели. Обработка и отображение на слабых платформах займёт меньше времени, но и чёткость трёхмерного изображения будет ниже.</p>
<p><strong>S</strong> Модель низкого качества. Малая чёткость, но отображается на любых устройствах.</p>
<p>По умолчанию формируется модель наиболее высокого качества. При нажатии на значок качества модели будет открыто диалоговое окно создания упрощённого представления.</p>
<p><img src="@source/user-docs/img/image11.png" alt="" loading="lazy"></p>
<p><code v-pre>Рис 11. Окно создания модели низкого качества</code></p>
<p>После завершения конвертации модели пользователь может скачать результат в любом из представленных форматов, нажав на кнопку с расширением файла модели справа. Кнопка «удалить все модели» позволяет удалить все файлы модели.</p>
<p><img src="@source/user-docs/img/image12.png" alt="" loading="lazy"></p>
<p><code v-pre>Рис 12. Форма скачивания конвертированных моделей.</code></p>
<h2 id="создание-текстур" tabindex="-1"><a class="header-anchor" href="#создание-текстур" aria-hidden="true">#</a> Создание текстур</h2>
<p>Поле управления материалами позволяет загрузить необходимые текстуры на существующий объект. Для привязки текстур к модели требуется создать коллекцию текстур (материал), нажав на кнопку «создать материал» в левом-нижнем углу.</p>
<p><img src="@source/user-docs/img/image13.png" alt="" loading="lazy"></p>
<p><code v-pre>Рис 13. Страница управления материалами</code></p>
<p>Создание материала требует ввода названия материала, ввода кода материала (артикул каждого отдельного набора текстур, уникальный для каждого материала) и загрузки фотографии с превью необходимого узора.</p>
<p><img src="@source/user-docs/img/image14.png" alt="" loading="lazy"></p>
<p><code v-pre>Рис 14. Создание текстуры</code></p>
<p>После создания набора материалов требуется в полях справа внести необходимые текстуры PBR материала в формате jpeg, чтобы применить цвета и узоры к модели. Результат применения каждого из материалов отображён в Таблице 2.</p>
<!-- title only -->
<h4 align="center"> Типы материалов </h4>
<p><code v-pre>Таблицa 2</code></p>
<table>
<thead>
<tr>
<th>Название материала</th>
<th>Описание действия</th>
</tr>
</thead>
<tbody>
<tr>
<td><strong>Base color</strong></td>
<td>Основной цвет. Цветовая гамма применяется к модели.</td>
</tr>
<tr>
<td><strong>Emission</strong></td>
<td>Излучение света, если требуется внести флуоресценцию.</td>
</tr>
<tr>
<td><strong>Metallic-Roughness</strong></td>
<td>Применение металлического отлива. Чем светлее определённая часть текстуры, тем более отражающей и «металлической» будет часть поверхности</td>
</tr>
<tr>
<td><strong>Normals</strong></td>
<td>Формирование текстурных неровностей, не отражённых на самой модели</td>
</tr>
<tr>
<td><strong>Occlusion</strong></td>
<td>Текстура теней. Позволяет сделать модель более объёмной за счёт создания теней.</td>
</tr>
</tbody>
</table>
<p><img src="@source/user-docs/img/image15.png" alt="" loading="lazy">
<code v-pre>Рис 15. Привязка текстур завершена.</code></p>
<p>Загрузив текстуры, требуется нажать кнопку «далее».</p>
<h2 id="выбор-виджетов" tabindex="-1"><a class="header-anchor" href="#выбор-виджетов" aria-hidden="true">#</a> Выбор виджетов</h2>
<p>Поле выбора виджетов позволяет выбрать различные дополнительные возможности по управлению представлением модели. Список виджетов и результатов их применения представлен в Таблице 3.</p>
<!-- title only -->
<h4 align="center"> Виджеты </h4>
<p><code v-pre>Таблицa 3</code></p>
<table>
<thead>
<tr>
<th>Название</th>
<th>Описание действия</th>
</tr>
</thead>
<tbody>
<tr>
<td><strong>Выбор иконки</strong></td>
<td>Позволяет загрузить собственную иконку в правом нижнем углу виджета</td>
</tr>
<tr>
<td><strong>Установка материала по умолчанию</strong></td>
<td>При наличии нескольких материалов позволяет выбрать тот, который будет всегда демонстрироваться первым</td>
</tr>
<tr>
<td><strong>Превью модели</strong></td>
<td>Позволяет включить файл – заставку перед демонстрацией модели.</td>
</tr>
<tr>
<td><strong>Дополненная реальность</strong></td>
<td>Даёт возможность представить продукт в дополненной реальности.</td>
</tr>
<tr>
<td><strong>Изменение размера в дополненной реальности</strong></td>
<td>Позволяет изменять размер модели в дополненной реальности в том случае, если требуется уменьшить или увеличить продукт в AR представлении</td>
</tr>
<tr>
<td><strong>Управление камерой</strong></td>
<td>Позволяет крутить камеру вокруг продукта</td>
</tr>
<tr>
<td><strong>Логотип Зарбо</strong></td>
<td>Позволяет удалить или поставить полный логотип Зарбо в виджете.</td>
</tr>
<tr>
<td><strong>Отключить увеличение модели при обычном просмотре</strong></td>
<td>Запрещает приближение или удаление продукта при просмотре в окне</td>
</tr>
<tr>
<td><strong>Изменение материала</strong></td>
<td>Включение позволяет выбрать материал продукта, если их несколько</td>
</tr>
<tr>
<td><strong>Положение модели</strong></td>
<td>Позволяет выбрать место расположения продукта: вертикальные или горизонтальные поверхности.</td>
</tr>
</tbody>
</table>
<p><img src="@source/user-docs/img/image16.png" alt="" loading="lazy"></p>
<p><code v-pre>Рис 16. Панель выбора виджетов</code></p>
<p>После выбора всех необходимых для просмотра модели функций, можно закрыть окно редактора, сохранение выполнится автоматически.</p>
<h2 id="настроика-ar-представления" tabindex="-1"><a class="header-anchor" href="#настроика-ar-представления" aria-hidden="true">#</a> Настройка AR представления</h2>
<p>Система &quot;Зарбо&quot; предполагает использование трёх методов представления продуктов в AR пространстве.</p>
<p><img src="@source/user-docs/img/image17.png" alt="" loading="lazy"></p>
<p><code v-pre>Рис 17. Выбор представления</code></p>
<!-- title only -->
<h4 align="center"> Типы представления </h4>
<p><code v-pre>Таблицa 3</code></p>
<table>
<thead>
<tr>
<th>Наименование</th>
<th>Описание</th>
</tr>
</thead>
<tbody>
<tr>
<td><strong>Web XR</strong></td>
<td>Средство просмотра для системы Андроид, имеющее расширенный функционал</td>
</tr>
<tr>
<td><strong>Scene viewer</strong></td>
<td>Более распространённое и поддерживаемое на большем числе устройств средство просмотра Андроид с ограниченным функционалом</td>
</tr>
<tr>
<td><strong>Quick look</strong></td>
<td>Средство просмотра для iOS</td>
</tr>
</tbody>
</table>
<h2 id="копирование-продукта" tabindex="-1"><a class="header-anchor" href="#копирование-продукта" aria-hidden="true">#</a> Копирование продукта</h2>
<p>Чтобы создать копию продукта в открытой коллекции, требуется нажать кнопку « <img src="@source/user-docs/img/image18.png" alt="" loading="lazy"> ». Копия появится без виджетов и материалов.</p>
<h2 id="удаление-продукта" tabindex="-1"><a class="header-anchor" href="#удаление-продукта" aria-hidden="true">#</a> Удаление продукта</h2>
<p>В коллекции продуктов напротив каждого продукта расположена кнопка « <img src="@source/user-docs/img/image19.png" alt="" loading="lazy"> ». Эта кнопка позволяет удалить уже созданный продукт. При нажатии на кнопку откроется окно подтверждения выбора, в котором требуется нажать кнопку «удалить».</p>
<p><img src="@source/user-docs/img/image20.png" alt="" loading="lazy"></p>
<p><code v-pre>Рис 18. Удаление продукта.</code></p>
</div></template>


