<template><div><h1 id="_1-список-терминов" tabindex="-1"><a class="header-anchor" href="#_1-список-терминов" aria-hidden="true">#</a> 1. Список терминов</h1>
<table>
<thead>
<tr>
<th>Термин</th>
<th>Определение</th>
</tr>
</thead>
<tbody>
<tr>
<td><strong>Модель</strong></td>
<td>Модель – цифровое отображение продукта, файл, который загружается в систему</td>
</tr>
<tr>
<td><strong>Продукт</strong></td>
<td>Продуктом в данной системе называется именно модель с подключёнными к ней способами представления (текстуры, расположение).</td>
</tr>
<tr>
<td><strong>Коллекция</strong></td>
<td>Коллекция – список различных продуктов, объединённых для удобства доступа. Коллекции позволяют быстро найти однотипные продукты.</td>
</tr>
<tr>
<td><strong>Виджет</strong></td>
<td>Представление продукта на сайте пользователя</td>
</tr>
</tbody>
</table>
</div></template>


