<template><div><h1 id="руководство-пользователя" tabindex="-1"><a class="header-anchor" href="#руководство-пользователя" aria-hidden="true">#</a> Руководство пользователя</h1>
<h2 id="введение" tabindex="-1"><a class="header-anchor" href="#введение" aria-hidden="true">#</a> Введение</h2>
<p>Сервис <strong>Zarbo</strong> предназначен для визуализации в 3D и дополненной реальности объемных моделей. Zarbo позволяет организовать структурированное хранение объемных моделей, а также настраивать параметры их визуализации – специальные виджеты, которые можно встраивать на сайт или интернет-магазин.</p>
</div></template>


