<template><div><h1 id="введение" tabindex="-1"><a class="header-anchor" href="#введение" aria-hidden="true">#</a> Введение</h1>
<h2 id="что-такое-zarbo" tabindex="-1"><a class="header-anchor" href="#что-такое-zarbo" aria-hidden="true">#</a> Что такое Zarbo</h2>
<p>Zarbo — это технологии 3D-моделирования и дополненной реальности (AR) для бизнеса. С нами вы можете оживлять любые товары: мебель, бытовую технику, спортивный инвентарь, игрушки, посуду и многое другое.</p>
<h2 id="как-это-работает" tabindex="-1"><a class="header-anchor" href="#как-это-работает" aria-hidden="true">#</a> Как это работает</h2>
<p>Мы создали сервис, на котором вы можете хранить объемные модели и настраивать Zarbo-виджеты — их можно размещать в вашем сайте, приложении или интернет-магазине, или просто отправлять их в мессенджерах.  С помощью этих виджетов посетители вашей интернет-площадки просматривают 3D-модель в разных ракурсах и цветовых решениях, а также могут примерить их к условиям физической реальности. Например, посмотреть, насколько цвет кровати подходит к интерьеру спальни или оценить, сколько места будет занимать беговая дорожка в гостиной.
Все трехмерные модели хранятся в вашем личном кабинете сервиса Zarbo. Вы распоряжаетесь ими по своему усмотрению: меняете настройки, загружаете на свою площадку или убираете в архив. Количество моделей и доступные функции зависит от выбранного вами тарифа <a href="https://zarbo.tech/prices" target="_blank" rel="noopener noreferrer">https://zarbo.tech/prices<ExternalLinkIcon/></a>.
Для каждой модели формируется уникальный QR-код. Вы можете распечатать его и разместить на упаковке, ценниках и рекламной продукции. Покупателям достаточно навести камеру смартфона на код, и он увидит изображение товара в 3D-формате. При этом покупателю не нужно скачивать никаких приложений. QR-код также хранится в вашем личном кабинете Zarbo.
Чтобы посетители вашего интернет-магазина могли посмотреть товар в онлайн-формате, на сайт для каждой модели устанавливается виджет, то есть кнопка. Для просмотра 3D-модели пользователь нажимает на кнопку. Скачивать какие-либо приложения в этом случае также не нужно.</p>
<h2 id="зачем-использовать-zarbo" tabindex="-1"><a class="header-anchor" href="#зачем-использовать-zarbo" aria-hidden="true">#</a> Зачем использовать Zarbo</h2>
<p>Есть как минимум 4 причины, почему вам стоит использовать технологии 3D-моделирования и дополненной реальности Zarbo:</p>
<ol>
<li>Польза для покупателей. Только представьте, насколько проще заказать мебель или бытовую технику, если заранее знаешь, что товар подходит по размеру, форме и цвету.</li>
<li>Снижение количества возвратов. Покупатели будут реже возвращать товар, так как сможете еще до оплаты и оформления заказа понять, насколько он ему подходит. Вы же не будете терять деньги, потраченные на обратную доставку товара. Да и положительных отзывов при минимальных возвратах гораздо больше.</li>
<li>Экономия на рекламе. 3D-модели запоминаются и сами себя рекламируют: покупатель обязательно сохранит в закладках сайт интернет-магазина, где смог не просто посмотреть, а примерить и оценить товар с разных ракурсов;</li>
<li>Экономия времени и денег на разработку необычных технических решений. У нас вы можете хранить, менять и загружать на сайт 3D-модели самостоятельно, не обращаясь к сторонним разработчикам. Вы оплачиваете тариф и пользуетесь всеми бонусами сервиса Zarbo, в простом и понятном интерфейсе которого разберётся даже неподготовленный пользователь.</li>
</ol>
</div></template>


